This notebook demonstrates OLAP Cube Operations using python.

In [1]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt
%matplotlib inline

In [2]:
data = pd.read_csv('data.csv')

In [3]:
data.head(5)

  Continent  Location  Product  Year  Sales
0      Asia    Mumbai   iPhone  2011     10
1      Asia    Mumbai     iPad  2011     53
2      Asia    Mumbai  MacBook  2011    125
3      Asia    Mumbai   iWatch  2011     10
4   America  New York   iPhone  2011    123

In [4]:
#Pivoting the dataframe on index Location and value for Sales with columns Product and Year.
pd.pivot_table(data,index=data['Location'],columns=['Product','Year'],values=['Sales'],aggfunc='sum')

           Sales
Product  MacBook           iPad           iPhone           iWatch
Year        2011 2012 2013 2011 2012 2013   2011 2012 2013   2011 2012 2013
Location
London        30   58   55   12   55   85     63  230   52     61   85   80
Mumbai       125   29   88   53  122   59     10   82   69     10    9   13
New York      22   33   54  129   52   72    123   11   24     95   27   22
Paris         33   41   17   45   52   58     60   62   31     29   47   16
Tokyo         59   81   37   91   77   19     94   43   88     72   55   62

In [5]:
#Pivoting the dataframe on index Year and value for Sales with column Location
pd.pivot_table(data,index=data['Year'],columns=['Location'],values=['Sales'],aggfunc='sum')

          Sales
Location London Mumbai New York Paris Tokyo
Year
2011        166    198      369   167   316
2012        428    242      123   202   256
2013        272    229      172   122   206

In [6]:
#Pivoting the dataframe on index Year and value for Sales with column Product
pd.pivot_table(data,index=data['Year'],columns=['Product'],values=['Sales'],aggfunc='sum')

          Sales
Product MacBook iPad iPhone iWatch
Year
2011        269  330    350    267
2012        242  358    428    223
2013        251  293    264    193

In [7]:
#Pivoting the dataframe on index Product and value for Sales with column Location
pd.pivot_table(data,index=data['Product'],columns=['Location'],values=['Sales'],aggfunc='sum')

          Sales
Location London Mumbai New York Paris Tokyo
Product
MacBook     143    242      109    91   177
iPad        152    234      253   155   187
iPhone      345    161      158   153   225
iWatch      226     32      144    92   189